# -*- coding: utf-8 -*-

def CCO2(t):  #烟气中CO2的平均定压比热 kJ/(Nm^3.C）
    
    c=[ 0.38231619,
        2.5207184E-4,
       -1.6633384E-7,
        7.6427112E-11,
       -2.0555466E-14,
        2.3407239E-18    
       ]

    r=c[0]
    for i in range(1,5):
         r +=c[i]*t**i

    return r*4.1868


def CN2(t):   #烟气中N2的平均定压比热 kJ/(Nm^3.C）
    
    c=[  0.30929091,
        -5.3739164E-6,
         6.2620324E-8,
        -4.7710105E-11,
         1.543612e-14
        -1.881896E-18,
       ]

    r=c[0]
    for i in range(1,5):
         r +=c[i]*t**i

    return r*4.1868

def CH2O(t):   #烟气中水蒸汽平均定压比热 kJ/(Nm^3.C）
    
    c=[  0.3567226,
         2.4795243E-5,
         5.7207222E-8,
        -3.5393369e-11,
         9.153884e-15
        -9.2691428E-19
       ]

    r=c[0]
    for i in range(1,5):
         r +=c[i]*t**i

    return r*4.1868

def CK(t):    #湿空气的平均定压比热 kJ/(Nm^3.C）
   
    c=[  0.31519196,
         3.5619473e-6,
         6.0760977e-8,
        -5.1300306e-11,
         1.7716406e-14
        -2.2616689e-18
       ]
    r= c[0]
    for i in range(1,5):
         r +=c[i]*t**i

    return r*4.1868

def CH(t):    #灰的比热 kJ/(kg.C）
    
    if (t<=900):
        r=0.189+0.5e-4*t
    else:
        r=0.17+0.65e-4*t
    return r*4.1868

print(CCO2(1000))
print(CN2(1000))
print(CH2O(1000))
print(CK(1000))
print(CH(1000))
    
